Revit 2024 API
IntersectionResultArrayIterator Class
An iterator to a array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class IntersectionResultArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class IntersectionResultArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class IntersectionResultArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.IntersectionResultArrayIterator
See Also
IntersectionResultArrayIterator Members
Autodesk.Revit.DB Namespace